# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリ
tap "homebrew/bundle"
tap "homebrew/cask"
#tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
#tap "homebrew/core"

# CLIアプリケーション
brew "git"
brew "git-secrets"
brew "mas"	# Mac App Store command line interface
brew "asdf"	# Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more
brew "yarn"
brew "sheldon"	# Shell plugin manage
brew "awscli"
brew "saml2aws"


# デスクトップアプリケーション
cask "visual-studio-code"
cask "google-chrome"
cask "docker"
cask "iterm2"
cask "warp"
cask "notion"

# フォント
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-cica"

# Mac App Store
mas "Magnet マグネット", id: 441258766
