# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリ
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLIアプリケーション
brew "git"
brew "git-secrets"
brew "gh"
brew "ghq" # Remote repository management made easy
brew "mas"	# Mac App Store command line interface
brew "asdf"	# Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more
brew "yarn"
brew "awscli"
brew "saml2aws"
brew "gitmoji"	# A gitmoji interactive command line tool for using emojis on commits.
brew "tmux"
brew "wget"
brew "im-select"
brew "powerlevel10k"

# デスクトップアプリケーション
cask "visual-studio-code"
cask "google-chrome"
cask "docker"
cask "notion"
cask "postman"
cask "raycast"
cask "alacritty"
cask "wezterm"

# フォント
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-cica"

# Mac App Store
