# Install directory
cask_args appdir: "/Applications"

# Library
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap manaflow-ai/cmux

# CLI App
brew "git"
brew "git-secrets"
brew "gh"
brew "ghq" # Remote repository management made easy
brew "mas"	# Mac App Store command line interface
brew "yarn"
brew "awscli"
brew "saml2aws"
brew "gitmoji"	# A gitmoji interactive command line tool for using emojis on commits.
brew "tmux"
brew "wget"
brew "im-select"
brew "powerlevel10k"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "procs"
brew "mise"
brew "starship"

# Desktop App
cask "visual-studio-code"
cask "google-chrome"
cask "docker"
cask "notion"
cask "postman"
cask "raycast"
cask "alacritty"
cask "wezterm"
cask "cursor"
cask "obsidian"
cask "cmux"

# Font
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-cica"

# Mac App Store

# VSCode Extensions
vscode "42crunch.vscode-openapi"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "janisdd.vscode-edit-csv"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rubocop.vscode-rubocop"
vscode "ruby-syntax-tree.vscode-syntax-tree"
vscode "saurabh.terminal-manager"
vscode "shopify.ruby-extensions-pack"
vscode "sianglim.slim"
vscode "sirmspencer.vscode-autohide"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
